Revit 2026 API

# BuiltInFailuresImportFailuresATFContainedUnsupportedGeometricData Property

---

**Note: This API is now obsolete.**

The original model contains unsupported geometric data.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedGeometricData instead.")]
public static FailureDefinitionId ATFContainedUnsupportedGeometricData { get; }
```
```vb
<ObsoleteAttribute("This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedGeometricData instead.")>
Public Shared ReadOnly Property ATFContainedUnsupportedGeometricData As FailureDefinitionId
	Get
```
```cpp
public:
[ObsoleteAttribute(L"This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedGeometricData instead.")]
static property FailureDefinitionId^ ATFContainedUnsupportedGeometricData {
	FailureDefinitionId^ get ();
}
```
```fsharp
[<ObsoleteAttribute("This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedGeometricData instead.")>]
static member ATFContainedUnsupportedGeometricData : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId

#### Reference

BuiltInFailuresImportFailures Class

Autodesk.Revit.DB Namespace